Revit 2027 API
WireTypeSet.ForwardIterator Method
Retrieve a forward moving iterator to the set.
Namespace: Autodesk.Revit.DB.Electrical
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual WireTypeSetIterator ForwardIterator()
Public Overridable Function ForwardIterator As WireTypeSetIterator
public:
virtual WireTypeSetIterator^ ForwardIterator()
abstract ForwardIterator : unit -> WireTypeSetIterator
override ForwardIterator : unit -> WireTypeSetIterator
Return Value
WireTypeSetIterator
Returns a forward moving iterator to the set.
See Also
Reference
WireTypeSet Class
Autodesk.Revit.DB.Electrical Namespace